In [2]:
import pandas as pd
a={'Name':["shan","amu"],'Marks':[100,100],"Gender":["Male","Female"]}
b=pd.DataFrame(a)
print(b)

   Name  Marks  Gender
0  shan    100    Male
1   amu    100  Female

# Display Top 3 Rows of the Data set

In [9]:
#b.head()
b.head(1)

   Name  Marks Gender
0  shan    100   Male

# Display Last 5 Rows of the Data Set

In [12]:
#b.tail()
b.tail(1)

  Name  Marks  Gender
1  amu    100  Female

# Find the shape of the dataset (Rows and Columns)

In [29]:
b.shape

(2, 3)

In [28]:
c=b.shape
print("Rows:",c[0])
print("Colums",c[1])

Rows: 2
Colums 3

# Information about data set

In [17]:
b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    2 non-null      object
 1   Marks   2 non-null      int64
 2   Gender  2 non-null      object
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

# Check null values in the dataset

In [30]:
b.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False

In [31]:
b.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [32]:
b.isnull().sum(axis=0)#row

Name      0
Marks     0
Gender    0
dtype: int64

In [33]:
b.isnull().sum(axis=1)#column

0    0
1    0
dtype: int64

# Get the Overall statistics about Dataframe

In [34]:
b.describe()

       Marks
count    2.0
mean   100.0
std      0.0
min    100.0
25%    100.0
50%    100.0
75%    100.0
max    100.0

In [35]:
b.describe(include='all')

        Name  Marks Gender
count      2    2.0      2
unique     2    NaN      2
top     shan    NaN   Male
freq       1    NaN      1
mean     NaN  100.0    NaN
std      NaN    0.0    NaN
min      NaN  100.0    NaN
25%      NaN  100.0    NaN
50%      NaN  100.0    NaN
75%      NaN  100.0    NaN
max      NaN  100.0    NaN

# Find Unique Values from Gender column

In [27]:
b['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# Find the Number unique values in a Gender Column

In [36]:
b['Gender'].nunique()

2

# Display the Count of unique Values in gender Column

In [38]:
b['Gender'].value_counts()

Male      1
Female    1
Name: Gender, dtype: int64

# Marks Between 90 to 100

In [39]:
b['Marks']>=90

0    True
1    True
Name: Marks, dtype: bool

In [41]:
b[b['Marks']>=90]

   Name  Marks  Gender
0  shan    100    Male
1   amu    100  Female

In [43]:
b[(b['Marks']>=90) & (b['Marks']<=100)]

   Name  Marks  Gender
0  shan    100    Male
1   amu    100  Female

In [45]:
b[b['Marks'].between(90,100)]

   Name  Marks  Gender
0  shan    100    Male
1   amu    100  Female

# Average Marks

In [46]:
b['Marks'].mean()

100.0

# Apply Method

In [47]:
def shan(x):
    return x/2

In [48]:
b['Marks'].apply(shan)

0    50.0
1    50.0
Name: Marks, dtype: float64

In [50]:
b['Half_Marks']=b['Marks'].apply(shan)
b

   Name  Marks  Gender  Half_Marks
0  shan    100    Male        50.0
1   amu    100  Female        50.0

In [51]:
b['Marks'].apply(lambda x:x/2)

0    50.0
1    50.0
Name: Marks, dtype: float64

In [58]:
b['Name_len']=b['Name'].apply(len)
b

   Name  Marks  Gender  Half_Marks  Male_Fem  Name_len
0  shan    100    Male        50.0         1         4
1   amu    100  Female        50.0         0         3

# Map Function

In [53]:
b['Gender'].map({'Male':1,'Female':0})

0    1
1    0
Name: Gender, dtype: int64

In [55]:
b['Male_Fem']=b['Gender'].map({'Male':1,'Female':0})
b

   Name  Marks  Gender  Half_Marks  Male_Fem
0  shan    100    Male        50.0         1
1   amu    100  Female        50.0         0

# Drop Columns

In [56]:
b.drop('Male_Fem',axis=1)

   Name  Marks  Gender  Half_Marks
0  shan    100    Male        50.0
1   amu    100  Female        50.0

# Drop Multiple Columns

In [62]:
b.drop(["Half_Marks","Name_len",'Male_Fem'],axis=1)

   Name  Marks  Gender
0  shan    100    Male
1   amu    100  Female

In [63]:
b.drop(['Half_Marks','Name_len','Male_Fem'],axis=1,inplace=True)#changing a existing data

In [64]:
b

   Name  Marks  Gender
0  shan    100    Male
1   amu    100  Female

# Print The name of the Columns

In [65]:
b.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [66]:
b.index

RangeIndex(start=0, stop=2, step=1)

# Sort the dataframe

In [68]:
b.sort_values(by='Name',ascending=True)

   Name  Marks  Gender
1   amu    100  Female
0  shan    100    Male

In [71]:
b.sort_values(by=['Marks','Name'],ascending=False)

   Name  Marks  Gender
0  shan    100    Male
1   amu    100  Female

# Display Name and Marks

In [72]:
b[b['Gender']=='Female']

  Name  Marks  Gender
1  amu    100  Female

In [73]:
b[b['Gender']=='Female'][['Name','Marks']]

  Name  Marks
1  amu    100

In [75]:
b[b['Gender'].isin(['Male'])]['Name']

0    shan
Name: Name, dtype: object